---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ElasticModulusWeakAxis
source: html/886adb1b-5f71-6863-5ccb-f7d754cb4066.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ElasticModulusWeakAxis Property

Elastic section modulus about main weak axis for calculation of bending stresses.

## Syntax (C#)
```csharp
public double ElasticModulusWeakAxis { get; set; }
```